Revit 2024 API
ValueAtPointBase.GetFlags Method
 Returns flags for the given measurement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public int GetFlags(
	int measurement
)
Visual Basic
Public Function GetFlags ( _
	measurement As Integer _
) As Integer
Visual C++
public:
int GetFlags(
	int measurement
)
Parameters
measurement
Type: System.Int32
 Measurement number for which flags are returned.
Return Value
 Flags value for the measurement.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for measurement is negative.
See Also
ValueAtPointBase Class
Autodesk.Revit.DB Namespace